## Plans :heavy_multiplication_x:

Running plans **FAILED**.  See **Terrateam Plan Output**.

After resolving the issue, run `terrateam plan` to execute the plan operation again.

## Terrateam Plan Output: production :heavy_multiplication_x:
<details>
  <summary>Expand for plan output details</summary>

<details>
  <summary><h3>Pre Hooks</h3></summary>

**Step**: cost-estimation
**Success**: :thumbsup:
```
'terraformWorkspace'
```
</details>

<details>
  <summary><h3>Post Hooks</h3></summary>

</details>


## Dir: . | :heavy_multiplication_x:
**Dir**: .
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: run
**Success**: :thumbsup:
**Details**: `tofu init`
```
                                                                           0.0%######################################################################## 100.0%

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 4.16"...
- Installing hashicorp/aws v4.67.0...
- Installed hashicorp/aws v4.67.0 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that OpenTofu can guarantee to make the same selections by default when
you run "tofu init" in the future.

OpenTofu has been successfully initialized!

```
**Step**: plan
**Success**: :thumbsup:
```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # aws_s3_bucket.resourcely-test_RUfxwvYmtDixPwyb will be created
  + resource "aws_s3_bucket" "resourcely-test_RUfxwvYmtDixPwyb" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "test"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_ownership_controls.resourcely-test_RUfxwvYmtDixPwyb will be created
  + resource "aws_s3_bucket_ownership_controls" "resourcely-test_RUfxwvYmtDixPwyb" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_public_access_block.resourcely-test_RUfxwvYmtDixPwyb will be created
  + resource "aws_s3_bucket_public_access_block" "resourcely-test_RUfxwvYmtDixPwyb" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_versioning.resourcely-test_RUfxwvYmtDixPwyb will be created
  + resource "aws_s3_bucket_versioning" "resourcely-test_RUfxwvYmtDixPwyb" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```
**Step**: run
**Success**: :heavy_multiplication_x:
**Details**: `resourcely-cli --no_color evaluate --error_on_violations --format json --change_request_url https://github.com/blimpup/prod-demo/pull/8 --change_request_sha fa24fcada14ba5dad357d6173e62f0a7d4ae736e --plan /tmp/tmpg4o567ky/json`
```
{
  "actions": {
    "approver": "security"
  },
  "guardrail_id": "9dcc9113-60dc-40ab-9dfc-d3347b335636",
  "paths": [
    "aws_s3_bucket.resourcely-test_RUfxwvYmtDixPwyb.bucket"
  ],
  "requirement": "bucket STARTSWITH \"resourcely\"",
  "resource": {
    "address": "aws_s3_bucket.resourcely-test_RUfxwvYmtDixPwyb",
    "id": "aws_s3_bucket.resourcely-test_RUfxwvYmtDixPwyb",
    "plan_id": "9ec9caa4-b934-5b6c-8431-2e3fa4c29d16",
    "type": "aws_s3_bucket",
    "environment": "",
    "tf_config_root_path": ""
  },
  "type": "fail"
}
```

</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
